app/controllers/songs_controller.rb

  def index
    if (params[:artist_id]) then
      artist = Artist.find(params[:artist_id])
      if artist then
        @songs = artist.songs
      else
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]

  def show
    if (params[:artist_id]) then
      artist = Artist.find(params[:artist_id])
      if artist then
        @song = artist.songs.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 5], ["id", 12345]]